{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_19", "config": {"batch_input_shape": [null, 100, 100, 1], "dtype": "float32", "name": "input_19", "sparse": false}}, {"inbound_nodes": [[["input_19", 0, 0, {}]]], "class_name": "Conv2D", "name": "conv2d_24", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "name": "conv2d_24", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "filters": 32, "kernel_constraint": null, "dilation_rate": [1, 1], "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_38", "config": {"gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_38", "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]], "class_name": "Activation", "name": "activation_92", "config": {"trainable": true, "name": "activation_92", "activation": "relu"}}, {"inbound_nodes": [[["activation_92", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "max_pooling2d_24", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_24", "padding": "valid", "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]], "class_name": "Activation", "name": "activation_93", "config": {"trainable": true, "name": "activation_93", "activation": "relu"}}, {"inbound_nodes": [[["activation_93", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_69", "config": {"rate": 0.2, "seed": null, "trainable": true, "name": "dropout_69", "noise_shape": null}}, {"inbound_nodes": [[["dropout_69", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_66", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_75", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 128}}, "trainable": true, "name": "time_distributed_66"}}, {"inbound_nodes": [[["time_distributed_66", 0, 0, {}]]], "class_name": "Activation", "name": "activation_94", "config": {"trainable": true, "name": "activation_94", "activation": "relu"}}, {"inbound_nodes": [[["activation_94", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_70", "config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_70", "noise_shape": null}}, {"inbound_nodes": [[["dropout_70", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_67", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_76", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 128}}, "trainable": true, "name": "time_distributed_67"}}, {"inbound_nodes": [[["time_distributed_67", 0, 0, {}]]], "class_name": "Activation", "name": "activation_95", "config": {"trainable": true, "name": "activation_95", "activation": "relu"}}, {"inbound_nodes": [[["activation_95", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_71", "config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_71", "noise_shape": null}}, {"inbound_nodes": [[["dropout_71", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_68", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_77", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 128}}, "trainable": true, "name": "time_distributed_68"}}, {"inbound_nodes": [[["time_distributed_68", 0, 0, {}]]], "class_name": "Activation", "name": "activation_96", "config": {"trainable": true, "name": "activation_96", "activation": "relu"}}, {"inbound_nodes": [[["activation_96", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_72", "config": {"rate": 0.5, "seed": null, "trainable": true, "name": "dropout_72", "noise_shape": null}}, {"inbound_nodes": [[["dropout_72", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_18", "config": {"target_shape": [2401, 128], "trainable": true, "name": "reshape_18"}}, {"inbound_nodes": [[["reshape_18", 0, 0, {}]]], "class_name": "Bidirectional", "name": "bidirectional_16", "config": {"layer": {"class_name": "SimpleRNN", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "simple_rnn_16", "recurrent_regularizer": null, "return_state": false, "unroll": false, "bias_regularizer": null, "activation": "tanh", "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dropout": 0.0, "return_sequences": true, "stateful": false, "units": 1000, "recurrent_dropout": 0.0, "go_backwards": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "recurrent_constraint": null}}, "trainable": true, "name": "bidirectional_16", "merge_mode": "concat"}}, {"inbound_nodes": [[["bidirectional_16", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_39", "config": {"gamma_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_39", "gamma_regularizer": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]], "class_name": "TimeDistributed", "name": "time_distributed_69", "config": {"layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_78", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "sigmoid", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 1}}, "trainable": true, "name": "time_distributed_69"}}, {"inbound_nodes": [[["time_distributed_69", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_10", "config": {"trainable": true, "name": "flatten_10"}}, {"inbound_nodes": [[["flatten_10", 0, 0, {}]]], "class_name": "Dense", "name": "dense_79", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_79", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "activation": "relu", "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "units": 11}}], "input_layers": [["input_19", 0, 0]], "name": "model_15", "output_layers": [["dense_79", 0, 0]]}, "keras_version": "2.1.5"}